-- Пусть в таблице users поля created_at и updated_at оказались незаполненными. Заполните их текущими датой и временем.

select * from users;

/*1	Геннадий	1990-10-05	2021-02-14 16:33:31	2021-02-14 16:33:31
2	Наталья	1984-11-12	2021-02-14 16:33:31	2021-02-14 16:33:31
3	Александр	1985-05-20	2021-02-14 16:33:31	2021-02-14 16:33:31
4	Сергей	1988-02-14	2021-02-14 16:33:31	2021-02-14 16:33:31
5	Иван	1998-01-12	2021-02-14 16:33:31	2021-02-14 16:33:31
6	Мария	1992-08-29	2021-02-14 16:33:31	2021-02-14 16:33:31*/

update users set created_at = NULL, updated_at = NULL; 
select * from users;

/*1	Геннадий	1990-10-05		
2	Наталья	1984-11-12		
3	Александр	1985-05-20		
4	Сергей	1988-02-14		
5	Иван	1998-01-12		
6	Мария	1992-08-29	*/	

update users set created_at = NOW(), updated_at = NOW(); 
select * from users;

/*id	name	birthday_at	created_at	updated_at
1	Геннадий	1990-10-05	2021-02-14 16:34:20	2021-02-14 16:34:20
2	Наталья	1984-11-12	2021-02-14 16:34:20	2021-02-14 16:34:20
3	Александр	1985-05-20	2021-02-14 16:34:20	2021-02-14 16:34:20
4	Сергей	1988-02-14	2021-02-14 16:34:20	2021-02-14 16:34:20
5	Иван	1998-01-12	2021-02-14 16:34:20	2021-02-14 16:34:20
6	Мария	1992-08-29	2021-02-14 16:34:20	2021-02-14 16:34:20*/

