/*Таблица users была неудачно спроектирована. 
 Записи created_at и updated_at были заданы типом VARCHAR и в них долгое время помещались значения в формате 20.10.2017 8:10. 
 Необходимо преобразовать поля к типу DATETIME, сохранив введённые ранее значения.*/

select * from users;

/*id	name	birthday_at	created_at	updated_at
1	Геннадий	1990-10-05	2021-02-14 16:52:10	2021-02-14 16:52:10
2	Наталья	1984-11-12	2021-02-14 16:52:10	2021-02-14 16:52:10
3	Александр	1985-05-20	2021-02-14 16:52:10	2021-02-14 16:52:10
4	Сергей	1988-02-14	2021-02-14 16:52:10	2021-02-14 16:52:10
5	Иван	1998-01-12	2021-02-14 16:52:10	2021-02-14 16:52:10
6	Мария	1992-08-29	2021-02-14 16:52:10	2021-02-14 16:52:10*/

alter table users modify column created_at VARCHAR(255), modify column updated_at VARCHAR(255); 
describe users;

/*Field	Type	Null	Key	Default	Extra
id	bigint unsigned	NO	PRI	[NULL]	auto_increment
name	varchar(255)	YES		[NULL]	
birthday_at	date	YES		[NULL]	
created_at	varchar(255)	YES		[NULL]	
updated_at	varchar(255)	YES		[NULL]	*/

select * from users;

/*id	name	birthday_at	created_at	updated_at
1	Геннадий	1990-10-05	2021-02-14 16:52:10	2021-02-14 16:52:10
2	Наталья	1984-11-12	2021-02-14 16:52:10	2021-02-14 16:52:10
3	Александр	1985-05-20	2021-02-14 16:52:10	2021-02-14 16:52:10
4	Сергей	1988-02-14	2021-02-14 16:52:10	2021-02-14 16:52:10
5	Иван	1998-01-12	2021-02-14 16:52:10	2021-02-14 16:52:10
6	Мария	1992-08-29	2021-02-14 16:52:10	2021-02-14 16:52:10*/

update users set created_at = DATE_FORMAT(created_at, '%d.%m.%y %h:%i') , updated_at = DATE_FORMAT( updated_at, '%d.%m.%y %h:%i');
select * from users;

/*id	name	birthday_at	created_at	updated_at
1	Геннадий	1990-10-05	14.02.21 04:52	14.02.21 04:52
2	Наталья	1984-11-12	14.02.21 04:52	14.02.21 04:52
3	Александр	1985-05-20	14.02.21 04:52	14.02.21 04:52
4	Сергей	1988-02-14	14.02.21 04:52	14.02.21 04:52
5	Иван	1998-01-12	14.02.21 04:52	14.02.21 04:52
6	Мария	1992-08-29	14.02.21 04:52	14.02.21 04:52*/

alter table users modify column created_at DATETIME, modify column updated_at DATETIME;
select * from users;

/*id	name	birthday_at	created_at	updated_at
1	Геннадий	1990-10-05	2014-02-21 04:52:00	2014-02-21 04:52:00
2	Наталья	1984-11-12	2014-02-21 04:52:00	2014-02-21 04:52:00
3	Александр	1985-05-20	2014-02-21 04:52:00	2014-02-21 04:52:00
4	Сергей	1988-02-14	2014-02-21 04:52:00	2014-02-21 04:52:00
5	Иван	1998-01-12	2014-02-21 04:52:00	2014-02-21 04:52:00
6	Мария	1992-08-29	2014-02-21 04:52:00	2014-02-21 04:52:00*/



